<template lang="pug">
    .calendar#calendar
        .ys_calendar
            h1 选择日期
            .head
                span 跳到
                input#Cal_y.inp(type='number', min='-9999', max="9999" v-model='calY' onchange="getLunar()")
                span 年
                input#Cal_m.inp(type='number', min="1" max='12', v-model='calM' onchange="getLunar()")
                span 月
            .btnx.back_today(onclick='changeMonth(2)') 回今天
            i.icon-close(@click="close")
            .btns
                i.icon-angle-double-left(onclick='changeYear(0)')
                i.icon-angle-double-right(onclick='changeYear(1)')
                i.icon-angle-left(onclick='changeMonth(0)')
                i.icon-angle-right(onclick='changeMonth(1)')
            #Cal2
            .btnx.toggle_dynasty(@click="dynastyFlag=!dynastyFlag")
                span 选择朝代
                i(:class="'icon-angle-'+(dynastyFlag?'up':'down')")
            .dynasty_box(:class="{show:dynastyFlag}")
                .list(v-for="it in item")
                    h5 {{it.name}}
                    ul
                        li(v-for="itx in it.list" @click="set(itx.y,itx.m)") {{itx.n}}



</template>

<script>

    export default {

        name: 'calendar',
        components:{
        },
        model: {
        },
        props: [],
        data () {
            let dx = new Date();
            return {
                calY:dx.getFullYear(),
                calM:dx.getMonth()+1,
                dynastyFlag:false,
                flag:false,
                item:[{name:"西汉",list:[{n:"汉高祖",y:-202,m:3},{n:"汉惠帝",y:-195,m:3},{n:"汉文帝",y:-180,m:3},{n:"汉景帝",y:-156,m:3},{n:"汉武帝",y:-141,m:3},{n:"汉昭帝",y:-87,m:3},{n:"汉宣帝",y:-74,m:3},{n:"汉元帝",y:-48,m:3},{n:"汉成帝",y:-33,m:3},{n:"汉哀帝",y:-7,m:3},{n:"汉平帝",y:-1,m:3},{n:"汉少帝",y:6,m:3}]},{name:"东汉",list:[{n:"光武帝",y:25,m:3},{n:"汉明帝",y:57,m:3},{n:"汉章帝",y:75,m:3},{n:"汉和帝",y:88,m:3},{n:"汉殇帝",y:106,m:3},{n:"汉安帝",y:106,m:3},{n:"汉顺帝",y:125,m:3},{n:"汉冲帝",y:144,m:3},{n:"汉质帝",y:145,m:3},{n:"汉桓帝",y:147,m:3},{n:"汉灵帝",y:168,m:3},{n:"汉少帝",y:189,m:3},{n:"汉献帝",y:189,m:3}]},{name:"曹魏",list:[{n:"黄初",y:220,m:3},{n:"太和",y:227,m:3},{n:"青龙",y:233,m:3},{n:"景初",y:237,m:3},{n:"正始",y:240,m:3},{n:"嘉平",y:249,m:3},{n:"正元",y:254,m:3},{n:"甘露",y:256,m:3},{n:"景元",y:260,m:3},{n:"咸熙",y:264,m:3}]},{name:"西晋",list:[{n:"泰始",y:265,m:3},{n:"咸宁",y:275,m:3},{n:"太康",y:280,m:3},{n:"太熙",y:290,m:3},{n:"永熙",y:290,m:3},{n:"永平",y:291,m:3},{n:"元康",y:291,m:3},{n:"永康",y:300,m:3},{n:"永宁",y:301,m:3},{n:"太安",y:302,m:3},{n:"永安",y:304,m:3},{n:"建武",y:304,m:3},{n:"永兴",y:304,m:3},{n:"光熙",y:306,m:3},{n:"永嘉",y:307,m:3},{n:"建兴",y:313,m:3}]},{name:"东晋",list:[{n:"建武",y:317,m:3},{n:"大兴",y:318,m:3},{n:"永昌",y:322,m:3},{n:"太宁",y:323,m:3},{n:"咸和",y:326,m:3},{n:"咸康",y:335,m:3},{n:"建元",y:343,m:3},{n:"永和",y:345,m:3},{n:"升平",y:357,m:3},{n:"隆和",y:362,m:3},{n:"兴宁",y:363,m:3},{n:"太和",y:366,m:3},{n:"咸安",y:371,m:3},{n:"宁康",y:373,m:3},{n:"太元",y:376,m:3},{n:"元熙",y:419,m:3}]},{name:"隋朝",list:[{n:"开皇",y:581,m:3},{n:"仁寿",y:601,m:3},{n:"大业",y:605,m:3},{n:"义宁",y:617,m:3},{n:"皇泰",y:618,m:3}]},{name:"唐朝",list:[{n:"武德",y:618,m:3},{n:"贞观",y:627,m:3},{n:"永徽",y:650,m:3},{n:"显庆",y:656,m:3},{n:"龙朔",y:661,m:3},{n:"麟德",y:664,m:3},{n:"乾封",y:666,m:3},{n:"总章",y:668,m:3},{n:"咸亨",y:670,m:3},{n:"上元",y:674,m:3},{n:"仪凤",y:676,m:3},{n:"调露",y:679,m:3},{n:"永隆",y:680,m:3},{n:"开耀",y:681,m:3},{n:"永淳",y:682,m:3},{n:"弘道",y:683,m:3},{n:"嗣圣",y:684,m:3},{n:"文明",y:684,m:3}]},{name:"武周",list:[{n:"光宅",y:684,m:3},{n:"垂拱",y:685,m:3},{n:"永昌",y:689,m:3},{n:"载初",y:689,m:3},{n:"天授",y:690,m:3},{n:"如意",y:692,m:3},{n:"长寿",y:692,m:3},{n:"延载",y:694,m:3},{n:"证圣",y:695,m:3},{n:"天册万岁",y:695,m:3},{n:"万岁登封",y:695,m:3},{n:"万岁通天",y:696,m:3},{n:"神功",y:697,m:3},{n:"圣历",y:698,m:3},{n:"久视",y:700,m:3},{n:"大足",y:701,m:3},{n:"长安",y:701,m:3},{n:"神龙",y:705,m:3},{n:"光宅",y:684,m:3},{n:"垂拱",y:685,m:3},{n:"永昌",y:689,m:3},{n:"载初",y:689,m:3}]},{name:"唐朝",list:[{n:"景龙",y:707,m:3},{n:"唐隆",y:710,m:3},{n:"景云",y:710,m:3},{n:"太极",y:712,m:3},{n:"延和",y:712,m:3},{n:"先天",y:712,m:3},{n:"开元",y:713,m:3},{n:"天宝",y:742,m:3},{n:"至德",y:756,m:3},{n:"乾元",y:758,m:3},{n:"上元",y:760,m:3},{n:"宝应",y:762,m:3},{n:"广德",y:763,m:3},{n:"永泰",y:765,m:3},{n:"大历",y:766,m:3},{n:"建中",y:780,m:3},{n:"兴元",y:784,m:3},{n:"贞元",y:785,m:3},{n:"永贞",y:805,m:3},{n:"元和",y:806,m:3},{n:"永新",y:820,m:3},{n:"长庆",y:821,m:3},{n:"宝历",y:825,m:3},{n:"大和",y:827,m:3},{n:"开成",y:836,m:3},{n:"会昌",y:841,m:3},{n:"大中",y:847,m:3},{n:"咸通",y:860,m:3},{n:"乾符",y:874,m:3}]},{name:"北宋",list:[{n:"建隆",y:960,m:3},{n:"乾德",y:963,m:11},{n:"开宝",y:968,m:11},{n:"太平兴国",y:976,m:12},{n:"雍熙",y:984,m:11},{n:"端拱",y:988,m:3},{n:"淳化",y:990,m:3},{n:"至道",y:995,m:3},{n:"咸平",y:998,m:3},{n:"景德",y:1004,m:3},{n:"大中祥符",y:1008,m:3},{n:"天禧",y:1017,m:3},{n:"乾兴",y:1022,m:3},{n:"天圣",y:1023,m:3},{n:"明道",y:1032,m:11},{n:"景祐",y:1034,m:3},{n:"宝元",y:1038,m:3},{n:"康定",y:1040,m:3},{n:"庆历",y:1041,m:3},{n:"皇祐",y:1049,m:3},{n:"至和",y:1054,m:3},{n:"嘉祐",y:1056,m:9},{n:"治平",y:1064,m:3},{n:"熙宁",y:1068,m:3},{n:"元丰",y:1078,m:3},{n:"元祐",y:1086,m:3},{n:"绍圣",y:1094,m:4},{n:"元符",y:1098,m:6},{n:"建中靖国",y:1101,m:3},{n:"崇宁",y:1102,m:3},{n:"大观",y:1107,m:3},{n:"政和",y:1111,m:3},{n:"重和",y:1118,m:11},{n:"宣和",y:1119,m:3},{n:"靖康",y:1126,m:3}]},{name:"南宋",list:[{n:"建炎",y:1127,m:3},{n:"绍兴",y:1131,m:3},{n:"隆兴",y:1163,m:3},{n:"乾道",y:1165,m:3},{n:"淳熙",y:1174,m:3},{n:"绍熙",y:1190,m:3},{n:"庆元",y:1195,m:3},{n:"嘉泰",y:1201,m:3},{n:"开禧",y:1205,m:3},{n:"嘉定",y:1208,m:3},{n:"宝庆",y:1225,m:3},{n:"绍定",y:1228,m:3},{n:"端平",y:1234,m:3},{n:"嘉熙",y:1237,m:3},{n:"淳祐",y:1241,m:3},{n:"宝祐",y:1253,m:3},{n:"开庆",y:1259,m:3},{n:"景定",y:1260,m:3},{n:"咸淳",y:1265,m:3},{n:"德祐",y:1275,m:3},{n:"景炎",y:1276,m:3},{n:"祥兴",y:1278,m:3}]},{name:"元朝",list:[{n:"中统",y:1260,m:6},{n:"至元",y:1264,m:8},{n:"元贞",y:1295,m:3},{n:"大德",y:1297,m:3},{n:"至大",y:1308,m:3},{n:"皇庆",y:1312,m:3},{n:"延祐",y:1314,m:3},{n:"至治",y:1321,m:3},{n:"泰定",y:1324,m:3},{n:"致和",y:1328,m:3},{n:"天顺",y:1328,m:9},{n:"天历",y:1328,m:9},{n:"至顺",y:1330,m:5},{n:"元统",y:1333,m:10},{n:"至元",y:1335,m:11},{n:"至正",y:1341,m:3}]},{name:"明朝",list:[{n:"洪武",y:1368,m:3},{n:"建文",y:1399,m:3},{n:"永乐",y:1403,m:3},{n:"洪熙",y:1425,m:3},{n:"宣德",y:1426,m:3},{n:"正统",y:1436,m:3},{n:"景泰",y:1450,m:3},{n:"天顺",y:1457,m:3},{n:"成化",y:1465,m:3},{n:"弘治",y:1488,m:3},{n:"正德",y:1504,m:3},{n:"嘉靖",y:1522,m:3},{n:"隆庆",y:1567,m:3},{n:"万历",y:1573,m:3},{n:"泰昌",y:1620,m:9},{n:"天启",y:1621,m:3},{n:"崇祯",y:1628,m:3}]},{name:"清朝",list:[{n:"崇德",y:1636,m:4},{n:"顺治",y:1644,m:3},{n:"康熙",y:1662,m:3},{n:"雍正",y:1723,m:3},{n:"乾隆",y:1736,m:3},{n:"嘉庆",y:1796,m:3},{n:"道光",y:1821,m:3},{n:"咸丰",y:1851,m:3},{n:"同治",y:1862,m:3},{n:"光绪",y:1875,m:3},{n:"宣统",y:1909,m:3}]}]

            }
        },
        mounted(){
            if(this.flag){
                this.init()
            }else {
                //因为calendar是全局异步加载的，避免出错而延时启用
                setTimeout(() =>{
                    this.init()
                },500)
            }
        },
        computed: {
        },
        methods:{
            init(){
                changeDate()
            },
            close(){
                // document.getElementById('calendar').className = 'calendar'
                this.$store.commit('SHOW_CALEN', false)
            },
            set(y,m){
                this.dynastyFlag = false;
                this.calY=y;
                this.calM=m;
                // changeDate()
                changeDate(y,m)
            }
        },
        watch: {
        }
    }
</script>
